In [5]:
mes=4

In [6]:
%run -i funcs_armazem.py
%matplotlib inline

WARNING *** file size (265753) not 512 + multiple of sector size (512)
WARNING *** OLE2 inconsistency: SSCS size is 0 but SSAT size is non-zero
WARNING *** file size (37433) not 512 + multiple of sector size (512)
WARNING *** OLE2 inconsistency: SSCS size is 0 but SSAT size is non-zero
WARNING *** file size (671597) not 512 + multiple of sector size (512)
WARNING *** OLE2 inconsistency: SSCS size is 0 but SSAT size is non-zero
WARNING *** file size (289760) not 512 + multiple of sector size (512)
WARNING *** OLE2 inconsistency: SSCS size is 0 but SSAT size is non-zero
WARNING *** file size (289760) not 512 + multiple of sector size (512)
WARNING *** OLE2 inconsistency: SSCS size is 0 but SSAT size is non-zero
WARNING *** file size (289760) not 512 + multiple of sector size (512)
WARNING *** OLE2 inconsistency: SSCS size is 0 but SSAT size is non-zero
WARNING *** file size (231043) not 512 + multiple of sector size (512)
WARNING *** OLE2 inconsistency: SSCS size is 0 but SSAT size is non-zero
WARNING *** file size (231043) not 512 + multiple of sector size (512)
WARNING *** OLE2 inconsistency: SSCS size is 0 but SSAT size is non-zero

In [7]:
metas = get_metas(mes=mes)
pop = get_populacao()
dados = get_data()

In [8]:
tables = ['tcv_mes','tcv_acum', 'thc_mes','thc_acum', 'tqf_mes','tqf_acum','iaf_mes','iaf_acum','tri_mes','tri_acum']

display(
    dados[tables[0]],
    dados[tables[1]],
    dados[tables[2]],
    dados[tables[3]],
    dados[tables[4]],
    dados[tables[5]],
    dados[tables[6]],
    dados[tables[7]],
    dados[tables[8]],
    dados[tables[9]]
    
)

        TCV_MES
            pop tcv_abs tcv_taxa meta_abs meta_taxa  var% farol
CIA
139 CIA  102919      27    26.23    39.91     38.78 -0.32     J
142 CIA  129575      26    20.07    46.56     35.93 -0.44     J
51 CIA   104360      19    18.21    30.41     29.14 -0.38     J
53 CIA    69242       6     8.67    19.00     27.44 -0.68     J
TOTAL    406096      78    19.21   135.88     33.46 -0.43     J

        TCV_ACUM
             pop tcv_abs tcv_taxa meta_abs meta_taxa  var% farol
CIA
139 CIA   102919     110   106.88   154.88    150.49 -0.29     J
142 CIA   129575     148   114.22   219.47    169.38 -0.33     J
51 CIA    104360      93    89.11   124.47    119.27 -0.25     J
53 CIA     69242      56    80.88    97.84    141.30 -0.43     J
TOTAL     406096     407   100.22   596.66    146.93 -0.32     J

        THC_MES
            pop thc_abs thc_taxa meta_abs meta_taxa  var% farol
CIA
139 CIA  102919       3     2.91     0.96      0.93  2.13     L
142 CIA  129575       0     0.00     2.89      2.23 -1.00     J
51 CIA   104360       1     0.96     0.96      0.92  0.04     K
53 CIA    69242       0     0.00     0.96      1.39 -1.00     J
TOTAL    406096       4     0.98     5.79      1.43 -0.31     J

        THC_ACUM
             pop thc_abs thc_taxa meta_abs meta_taxa  var% farol
CIA
139 CIA   102919       7     6.80     1.93      1.88  2.62     L
142 CIA   129575       5     3.86    14.47     11.17 -0.65     J
51 CIA    104360       9     8.62     3.86      3.70  1.33     L
53 CIA     69242       1     1.44     2.89      4.17 -0.65     J
TOTAL     406096      22     5.42    23.16      5.70 -0.05     J

        TQF_MES
            pop tqf_abs tqf_taxa meta_abs meta_taxa  var% farol
CIA
139 CIA  102919      83    80.65   113.38    110.16 -0.27     J
142 CIA  129575     190   146.63   165.75    127.92  0.15     K
51 CIA   104360     108   103.49   141.88    135.95 -0.24     J
53 CIA    69242      63    90.99   112.38    162.30 -0.44     J
TOTAL    406096     444   109.33   533.38    131.34 -0.17     J

        TQF_ACUM
             pop tqf_abs tqf_taxa meta_abs meta_taxa  var% farol
CIA
139 CIA   102919     420   408.09   424.88    412.83 -0.01     J
142 CIA   129575     704   543.31   650.50    502.03  0.08     K
51 CIA    104360     592   567.27   628.75    602.48 -0.06     J
53 CIA     69242     475   686.00   490.50    708.39 -0.03     J
TOTAL     406096    2191   539.53  2194.62    540.42 -0.00     J

        IAF_MES
            AFA TCAF  Índice  Meta  var% Farol
CIA
139 CIA       9   24   27.27  22.3  1.22     J
142 CIA      10   18   35.71  22.3  1.60     J
51 CIA        3    9   25.00  22.3  1.12     J
53 CIA        5    0  100.00  22.3  4.48     J
TOTAL        27   51   34.62  22.3  1.55     J

        IAF_ACUM
             AFA TCAF Índice  Meta  var% Farol
CIA
139 CIA       24   89  21.24  22.3  0.95     K
142 CIA       43  125  25.60  22.3  1.15     J
51 CIA        21   61  25.61  22.3  1.15     J
53 CIA        13   29  30.95  22.3  1.39     J
TOTAL        101  304  24.94  22.3  1.12     J

        TRI_MES
           NPAA TRCV   Taxa   Meta  var% Farol
CIA
139 CIA       6   24  25.00  22.19  1.13     J
142 CIA      14   25  56.00  22.19  2.52     J
51 CIA        4   13  30.77  22.19  1.39     J
53 CIA        3    5  60.00  22.19  2.70     J
TOTAL        27   67  40.30  22.19  1.82     J

        TRI_ACUM
            NPAA TRCV   Taxa   Meta  var% Farol
CIA
139 CIA       16   99  16.16  22.19  0.73     K
142 CIA       39  137  28.47  22.19  1.28     J
51 CIA        25   72  34.72  22.19  1.56     J
53 CIA        18   51  35.29  22.19  1.59     J
TOTAL         98  359  27.30  22.19  1.23     J

In [9]:
tables = ['tcv_mes','tcv_acum', 'thc_mes','thc_acum', 'tqf_mes','tqf_acum','iaf_mes','iaf_acum','tri_mes','tri_acum']

dfs = (
    dados[tables[0]],
    dados[tables[1]],
    dados[tables[2]],
    dados[tables[3]],
    dados[tables[4]],
    dados[tables[5]],
    dados[tables[6]],
    dados[tables[7]],
    dados[tables[8]],
    dados[tables[9]]
    
)

multiple_dfs(dfs, 'tcv-thc-tqf', 'indicadores_armazem.xlsx', 4)